"use strict";

// Суворий режим / Strict Mode / Строгий режим

// 1 Неможливість використосувати неоголошені змінні
const a = 10;

// 2 В суворому режимі генеруються помилки,
// багато з яких в несуворому ігноруються
const b = 10;
// b.name = "Test"; // в суворому не можна звернутися до властивості примітива

// 3 Контекстом функції в суворому режимі є undefined
// => не можна ф-конструктор використовувати без new
function User(name) {
  // вимикає спадкування глобального контексту:
  // в несуворому режимі this в функції є window
  // в суворому - undefined
  console.log("this :>> ", this);
  this.name = name;
}

const user = new User("Ivo");

// Можна вмикати окремо на рівні функції (наприклад, для legacy коду)
// function f(){
//     `use strict`
// }
